Tekla Open API Reference for Tekla Structures 2025
AABB Constructor
Overload List
Name | Description
AABB()
 Instantiates a new axis-aligned 3d bounding box with the maximum point initialized to the smallest possible value and the minimum point to the largest possible value.
AABB(AABB)
 Instantiates a new axis-aligned 3d bounding box which is a copy of the given axis-aligned 3d bounding box.
AABB(IEnumerable<Point>)
 Constructs AABB from given point list.
AABB(Point, Point)
 Instantiates a new axis-aligned 3d bounding box with the given minimum and maximum points.
Top
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace